# 实习三：非关系数据
---
## 组员：陈萧白，凤大骅，万承志

本次实习需要完成窗口查询，Json数据的读取、查询、输出，以及递归查询。我们先连接数据库，然后依次完成练习。

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
%load_ext sql
%sql mysql://stu2000012926:stu2000012926@162.105.146.37:43306
%sql use stu2000012926;

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.

[]

In [2]:
%%sql
show tables;

 * mysql://stu2000012926:***@162.105.146.37:43306
7 rows affected.

[('aggResult',),
 ('department',),
 ('employees',),
 ('max_slidingWin',),
 ('originData',),
 ('stock',),
 ('sum_slidingWin',)]

## 练习一：窗口函数
---
### 由于中间有大部分因子都有rank参数，因此并没有严格遵照每20个因子来实现一个，但总共实现的因子仍为5个。同时根据数据规模调整了部分因子的常数参数

首先建立一张表，并将已经获取的数据导入表中

In [3]:
%%sql
set foreign_key_checks=0;

drop table if exists stock;

CREATE TABLE stock (
    id INT UNSIGNED PRIMARY KEY,
    ts_code VARCHAR(10),
    trade_data DATE,
    open FLOAT,
    high FLOAT,
    low FLOAT,
    close FLOAT,
    pre_close FLOAT,
    chg FLOAT,
    pct_chg FLOAT,
    vol DOUBLE,
    amount DOUBLE
);

set foreign_key_checks=0;

INSERT INTO stock VALUES (2817,'600019.SH','2011-01-04',6.44,6.56,6.31,6.55,6.39,0.16,2.50,572249.83,369381.672);
INSERT INTO stock VALUES (2816,'600019.SH','2011-01-05',6.49,6.50,6.42,6.45,6.55,-0.10,-1.53,334574.19,215978.272);
INSERT INTO stock VALUES (2815,'600019.SH','2011-01-06',6.46,6.50,6.39,6.46,6.45,0.01,0.16,248061.88,159829.914);
INSERT INTO stock VALUES (2814,'600019.SH','2011-01-07',6.46,6.68,6.41,6.56,6.46,0.10,1.55,562598.63,368965.887);
INSERT INTO stock VALUES (2813,'600019.SH','2011-01-10',6.54,6.64,6.51,6.52,6.56,-0.04,-0.61,422610.09,277610.464);
INSERT INTO stock VALUES (2812,'600019.SH','2011-01-11',6.52,6.72,6.51,6.70,6.52,0.18,2.76,608401.78,403478.981);
INSERT INTO stock VALUES (2811,'600019.SH','2011-01-12',6.72,6.90,6.67,6.83,6.70,0.13,1.94,815284.93,554413.060);
INSERT INTO stock VALUES (2810,'600019.SH','2011-01-13',6.87,6.90,6.73,6.77,6.83,-0.06,-0.88,511347.57,348201.644);
INSERT INTO stock VALUES (2809,'600019.SH','2011-01-14',6.77,6.77,6.61,6.71,6.77,-0.06,-0.89,415524.64,277649.450);
INSERT INTO stock VALUES (2808,'600019.SH','2011-01-17',6.64,6.74,6.48,6.53,6.71,-0.18,-2.68,524684.69,346912.702);

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%%sql
SELECT * FROM stock;

 * mysql://stu2000012926:***@162.105.146.37:43306
10 rows affected.

[(2808, '600019.SH', datetime.date(2011, 1, 17), 6.64, 6.74, 6.48, 6.53, 6.71, -0.18, -2.68, 524684.69, 346912.702),
 (2809, '600019.SH', datetime.date(2011, 1, 14), 6.77, 6.77, 6.61, 6.71, 6.77, -0.06, -0.89, 415524.64, 277649.45),
 (2810, '600019.SH', datetime.date(2011, 1, 13), 6.87, 6.9, 6.73, 6.77, 6.83, -0.06, -0.88, 511347.57, 348201.644),
 (2811, '600019.SH', datetime.date(2011, 1, 12), 6.72, 6.9, 6.67, 6.83, 6.7, 0.13, 1.94, 815284.93, 554413.06),
 (2812, '600019.SH', datetime.date(2011, 1, 11), 6.52, 6.72, 6.51, 6.7, 6.52, 0.18, 2.76, 608401.78, 403478.981),
 (2813, '600019.SH', datetime.date(2011, 1, 10), 6.54, 6.64, 6.51, 6.52, 6.56, -0.04, -0.61, 422610.09, 277610.464),
 (2814, '600019.SH', datetime.date(2011, 1, 7), 6.46, 6.68, 6.41, 6.56, 6.46, 0.1, 1.55, 562598.63, 368965.887),
 (2815, '600019.SH', datetime.date(2011, 1, 6), 6.46, 6.5, 6.39, 6.46, 6.45, 0.01, 0.16, 248061.88, 159829.914),
 (2816, '600019.SH', datetime.date(2011, 1, 5), 6.49, 6.5, 6.42, 6.45, 6.55, -0.1, -1.53, 334574.19, 215978.272),
 (2817, '600019.SH', datetime.date(2011, 1, 4), 6.44, 6.56, 6.31, 6.55, 6.39, 0.16, 2.5, 572249.83, 369381.672)]

### 公式6：
原公式为 :`(-1 * correlation(open, volume, 10))`

由于数据规模问题，采取公式为:`(-1 * correlation(open, volume, 5))`，并舍弃前4个数据不足的行

In [5]:
%%sql
# Alpha#6: (-1 * correlation(open, volume, 5))
SELECT 
    tmp.id,
    ROUND(-1 * corr, 2) as alpha06
FROM (
    SELECT 
        id,
        (avg(open*vol) over (rows between 4 preceding and current row) 
        - avg(open) over (rows between 4 preceding and current row) 
        * avg(vol) over (rows between 4 preceding and current row))
        / (stddev_pop(open) over (rows between 4 preceding and current row)
        * stddev_pop(vol) over (rows between 4 preceding and current row)) as corr
    FROM stock
) AS tmp
WHERE id>=2812;

 * mysql://stu2000012926:***@162.105.146.37:43306
6 rows affected.

[(2812, 0.25),
 (2813, 0.0),
 (2814, -0.19),
 (2815, -0.77),
 (2816, -0.29),
 (2817, 0.28)]

### 公式23：
原公式为：`(((sum(high, 20) / 20) < high) ? (-1 * delta(high, 2)) : 0)`

由于数据规模问题，采取公式为:`(((sum(high, 3) / 3) < high) ? (-1 * delta(high, 2)) : 0)`，并舍弃前2个数据不足的行

In [6]:
%%sql
# Alpha#23: (((sum(high, 3) / 3) < high) ? (-1 * delta(high, 2)) : 0)
SELECT
    id,
    if (delta_sum_high<0, ROUND(-1*delta_high,2),0) as alpha23
FROM (
    SELECT
        id,
        sum(high) over (rows between 2 preceding and current row) 
        / 3 - high as delta_sum_high,
        (high - lag(high,2) over ()) as delta_high
    FROM stock
) AS tmp
WHERE id>= 2810;

 * mysql://stu2000012926:***@162.105.146.37:43306
8 rows affected.

[(2810, -0.16),
 (2811, -0.13),
 (2812, 0.0),
 (2813, 0.0),
 (2814, 0.0),
 (2815, 0.0),
 (2816, 0.0),
 (2817, -0.06)]

### 公式41：
原公式为:`(((high * low)^0.5) - vwap)`

In [7]:
%%sql
# Alpha#41: (((high * low)^0.5) - vwap)
SELECT
    id,
    ROUND(SQRT(high*low) - (amount/vol),2) as alpha41
FROM stock;

 * mysql://stu2000012926:***@162.105.146.37:43306
10 rows affected.

[(2808, 5.95),
 (2809, 6.02),
 (2810, 6.13),
 (2811, 6.1),
 (2812, 5.95),
 (2813, 5.92),
 (2814, 5.89),
 (2815, 5.8),
 (2816, 5.81),
 (2817, 5.79)]

### 公式53：
原公式为:`(-1 * delta((((close - low) - (high - close)) / (close - low)), 9))`

由于数据规模问题，采取公式为:`(-1 * delta((((close - low) - (high - close)) / (close - low)), 5))`，并舍弃前5个数据不足的行

In [8]:
%%sql
# Alpha#53: (-1 * delta((((close - low) - (high - close)) / (close - low)), 5))
SELECT 
    id,
    alpha53
FROM (
    SELECT
        id,
        ROUND(-1* (data - lag(data,5) over ()),2) as alpha53
    FROM (
        SELECT
            id,
            (((close - low) - (high - close)) / (close - low)) as data
        FROM stock
    ) AS tmp1
) AS tmp2
WHERE id>=2813;

 * mysql://stu2000012926:***@162.105.146.37:43306
5 rows affected.

[(2813, 7.8), (2814, 0.2), (2815, -2.68), (2816, 1.23), (2817, -0.06)]

### 公式84:
原公式为:`SignedPower(Ts_Rank((vwap - ts_max(vwap, 15.3217)), 20.7127), delta(close, 4.96796))`

由于数据规模问题，和小数的实际情况，采取公式为:`SignedPower(Ts_Rank((vwap - ts_max(vwap, 4)), 5), delta(close, 2))`，并只保留有意义的行

由于PERCENT_RANK只能对整个表生效，Ts_RANK最终使用子查询实现

In [9]:
%%sql
# Alpha#84: SignedPower(Ts_Rank((vwap - ts_max(vwap, 4)), 5), delta(close, 2))
WITH tmp1 AS (
    SELECT
        id,
        amount/vol - max(amount/vol) over (rows between 3 preceding and current row) as vwap,
        close - lag(close,2) over () as delta_close
    FROM stock
)
SELECT 
    id,
    if(ts_rank=0,0,ROUND(POWER(ts_rank, delta_close),2)) as alpha84
FROM(
    SELECT
        id,
        vwap,
        (SELECT COUNT(*)-1 FROM tmp1 t1 WHERE t1.vwap<= tmp1.vwap and t1.id<=tmp1.id and t1.id>=tmp1.id-4) / 
        (SELECT COUNT(*)-1 FROM tmp1 t1 WHERE t1.id<=tmp1.id and t1.id>=tmp1.id-4) as ts_rank,
        delta_close
    FROM tmp1
    WHERE id>=2811
) tmp2;

 * mysql://stu2000012926:***@162.105.146.37:43306
7 rows affected.

[(2811, 0.0),
 (2812, 0.0),
 (2813, 0.0),
 (2814, 0.0),
 (2815, 1.04),
 (2816, 1.0),
 (2817, 1.0)]

## 练习二：JSON
---